$(document).ready(function() {
    //alert('скрипт есть');
    //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    //Отправка формы регистрациии пользователя
    //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
        $(document).on('click', '#reg_button', function () {
            console.log('событие кнопки регистрации');
            //проверка на совпадение паролей
            if ($('#new_password_1').val() != $('#new_password_2').val()) {
                $('#reg_message').html('Пароли не совпадают!');
                return;
            }

            var $form = $('#form_reg');
            //console.log('отправка формы');

            $.ajax({
                type: 'post',
                url: '/admin/reg',
                data: $form.serialize()
            })

                .done(function (msg) {
                    $('#reg_message').text(msg);
                    //$("#ModalEnter").modal('hide');
                })

                .fail(function () {
                    $('#reg_message').text('Что-то пошло не так... Обратитесь к администратору');
                });
        });
	
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//НАЖАТИЕ КНОПКИ УДАЛИТЬ ПОЛЬЗОВАТЕЛЯ
//в контексте администратора
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

	$(document).on('click', '.ref_delete_user', function(e){

		e.preventDefault();
		//отправляем аяксом id документа, который собрались удалить
		$.ajax({
			method: 'POST',
			url: '/admin/delete_user',
			data: { username: $(this).attr('href')},
			success: function( msg ) {
				//в ответе приходит список пользователей без удалённого пользователя
				$('#main_content').html(msg);
			},
			
			error: function() {
				alert('Что-то пошло не так... Обратитесь к администратору');
			}
			
		})

		

	
	//console.log(username);
	});
	

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//ПОКАЗЫВАЕМ ЛОГИ!
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++	
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	$(document).on('click', '.logs', function(e){
		console.log('OK');
		e.preventDefault();
        var $form = $('#filterLog');
		//var page = $(this).attr('href');
		//отправляем аяксом id документа, который собрались удалить
		$.ajax({
			method: "post",
			url: "/admin/logs",
			data: $form.serialize(),
			success: function( msg ) {
				//в ответе приходит список пользователей без удалённого пользователя
				$('#main_content').html(msg);
			},
			
			error: function() {
				alert('Что-то пошло не так... Обратитесь к администратору');
			}
		})
	//console.log(username);
	});

})